app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "sdfdf"], ["room_number", 123]]
---
  def create
    school_class = SchoolClass.create(post_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])